qodome/Firmware/iQo/IQ14BLW/nrf51/s130_demo_app/main.c
/* Copyright (c) 2014, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 *   * Redistributions of source code must retain the above copyright notice, this
 *     list of conditions and the following disclaimer.
 *
 *   * Redistributions in binary form must reproduce the above copyright notice,
 *     this list of conditions and the following disclaimer in the documentation
 *     and/or other materials provided with the distribution.
 *
 *   * Neither the name of Nordic Semiconductor ASA nor the names of its
 *     contributors may be used to endorse or promote products derived from
 *     this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
 
 /** @file
 *
 * @defgroup s130_demo main.c
 * @brief Main file for Heart Rate measurement data collector. Sample Application for nRF51822 evaluation board for S130
 *
 * This file contains the source code for a sample application using S130 as collector of data from
 * up to three peer peripheral devices running Heart Rate Service (a sample application from SDK) for the nRF51822 evaluation board (PCA10001).
 * Average value of each of peer peripheral can be sent to peer central as notifications.
 */
 
#include <stdint.h>
#include <string.h>
#include <stdarg.h>
#include <stdlib.h>
#include <stdio.h>
#include "nrf_soc.h"
#include "nrf_sdm.h"
#include "ble.h"
#include "ble_hci.h"
#include "app_assert.h"
#include "board_config.h"
#include "uart.h"
#include "rtc1.h"
#include "app_timer.h"
#include "nrf_gpio.h"

/* Addresses of peer peripherals that are expeted to run Heart Rate Service. */
#define NUMBER_OF_PERIPHERALS                   3
static const ble_gap_addr_t gs_hb_peripheral_address[NUMBER_OF_PERIPHERALS] = {{BLE_GAP_ADDR_TYPE_RANDOM_STATIC, {0x00, 0x0D, 0x80, 0x20, 0x12, 0xD9}} /*0xD91220800D00*/,	\
                                                {BLE_GAP_ADDR_TYPE_RANDOM_STATIC, {0x00, 0x04, 0x80, 0x20, 0x00, 0xC8}} /*0xC80020800400*/,	\
                                                {BLE_GAP_ADDR_TYPE_RANDOM_STATIC, {0x00, 0x04, 0x80, 0x20, 0x12, 0xF8}} /*0xF81220800400*/};

                                                /* Service exposed to Central to be used for sending average values - of data collected from peer peripherals - as notifications. */
#define SERVICE_UUID128                         0x1b, 0xc5, 0xd5, 0xa5, 0x02, 0x00, 0xbe, 0xa1, 0xe3, 0x11, 0x6b, 0xed, 0x40, 0xfe, 0x0b, 0x31 /* UUID 128: 310bfe40-ed6b-11e3-a1be-0002a5d5c51b */
#define SERVICE_CHARACTERISTIC_UUID             0x9001
#define SERVICE_CHARACTERISTIC_VALUE            {0,0,0}
#define SERVICE_CHARACTERISTIC_DESCRIPTOR_UUID  0x9002
#define SERVICE_CHARACTERISTIC_DESC_VALUE       "Average"

/* Services on Peripherals */
#define HEART_RATE_SERVICE                      0x180D
#define HEART_RATE_SERVICE_CHARACTERISTICS      0x2A37              /* HR Measurement service characteristic */
#define HEART_RATE_SERVICE_DESCRIPTOR           0x2902              /* HR Measurement service descriptor */
#define BUFFER_SIZE                             16
#define WRITE_VALUE_ENABLE_NOTIFICATIONS        0x0001              /* Enable notifications command. */
#define WRITE_VALUE_DISABLE_NOTIFICATIONS       0x0000              /* Disable notifications command. */

#define APPLICATION_NAME                        'S','1','3','0','d','e','m','o'
#define APPLICATION_NAME_SIZE                   8
#define SCAN_RESPONSE_DATA                      {0x04, 'D', 'E', 'M', 'O'}

#define APP_ADV_INTERVAL                        MSEC_TO_UNITS(25, UNIT_0_625_MS)  /* The advertising interval (in units of 0.625 ms. This value corresponds to 25 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS              60                                /* The advertising timeout in units of seconds. */

#define CENTRAL_MIN_CONN_INTERVAL               MSEC_TO_UNITS(500, UNIT_1_25_MS)  /* Minimum acceptable connection interval (500 ms). */
#define CENTRAL_MAX_CONN_INTERVAL               MSEC_TO_UNITS(500, UNIT_1_25_MS)  /* Maximum acceptable connection interval (500 ms). */
#define CENTRAL_SLAVE_LATENCY                   0                                 /* Slave latency. */
#define CENTRAL_CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)   /* Connection supervisory timeout (4 seconds). */

#define PERIPHERAL_MIN_CONN_INTERVAL            MSEC_TO_UNITS(50, UNIT_1_25_MS)   /* Minimum acceptable connection interval ( 50 ms). */
#define PERIPHERAL_MAX_CONN_INTERVAL            MSEC_TO_UNITS(50, UNIT_1_25_MS)   /* Maximum acceptable connection interval ( 50 ms). */
#define PERIPHERAL_SLAVE_LATENCY                0                                 /* Slave latency. */
#define PERIPHERAL_CONN_SUP_TIMEOUT             MSEC_TO_UNITS(1000, UNIT_10_MS)   /* Connection supervisory timeout (1 second). */

#define SCAN_INTERVAL                           MSEC_TO_UNITS(100, UNIT_0_625_MS) /* Scan interval between 2.5ms to 10.24s  (100 ms).*/
#define SCAN_WINDOW                             MSEC_TO_UNITS(80, UNIT_0_625_MS)  /* Scan window between 2.5ms to 10.24s    ( 80 ms). */
#define SCAN_TIMEOUT                            0xFFFF                            /* Scan timeout between 0x0001 and 0xFFFF in seconds, 0x0000 disables timeout. */

// Application Timer
#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_MAX_TIMERS            2                                           /**< Maximum number of simultaneously created timers. */
#define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues. */


/**@brief To convert ticks from milliseconds
 * @param[in] time          Number of millseconds that needs to be converted.
 * @param[in] resolution    Units to be converted.
 */
#define MSEC_TO_UNITS(TIME, RESOLUTION) (((TIME) * 1000) / (RESOLUTION))

/**@brief Local function prototypes. 
 */
static void board_configure(void);
static void uart_logf(const char *fmt, ...);
static uint32_t advertise(void);

/*****************************************************************************
* Logging and printing to UART
*****************************************************************************/

/**@brief Disable logging to UART by commenting out this line.*/
#define USE_UART_LOG_INFO   /* Enable to print standard output to UART. */
#define USE_UART_LOG_DEBUG  /* Enable to print standard output to UART. */

