qodome/Firmware/iQo/IQ14BLW/nrf51/s130_demo_app/main.c
/**@brief Macro defined to output log data on the UART or not as user information __PRINT or debug __LOG,
                    based on the USE_UART_LOGGING and USE_UART_PRINTING flag. 
                    If logging/printing is disabled, it will just yield a NOP instruction. 
*/
#ifdef USE_UART_LOG_DEBUG
    #define LOG_DEBUG(F, ...) (uart_logf("S130_DEMO_LOG: %s: %d: " F "\r\n", __FILE__, __LINE__, ##__VA_ARGS__))
#else
    #define LOG_DEBUG(F, ...) (void)__NOP()
#endif
#ifdef USE_UART_LOG_INFO
    #define _LOG_INFO(F, ...) (uart_logf(F, ##__VA_ARGS__))
    #define LOG_INFO(F, ...) (uart_logf(F "\r\n", ##__VA_ARGS__))
#else
	#define _LOG_INFO(F, ...) (void)__NOP()
    #define LOG_INFO(F, ...) (void)__NOP()
#endif


/*****************************************************************************
* Asserts handling
*****************************************************************************/

/**@brief Callback handlers for SoftDevice and application asserts. 
 */
void softdevice_assert_callback(uint32_t pc, uint16_t line_num, const uint8_t *file_name);
void app_assert_callback(uint32_t line_num, const uint8_t *file_name);

/**@brief Global variables used for storing assert information from the SoftDevice.
 */
static uint32_t gs_sd_assert_line_num;
static uint8_t  gs_sd_assert_file_name[100];

/**@brief Global variables used for storing assert information from the test application.
 */
static uint32_t gs_app_assert_line_num;
static uint8_t  gs_app_assert_file_name[100];

static app_timer_id_t m_app_timer_id;
static app_timer_id_t scheduler_timer_id;
static uint8_t scheduler_flag = 0;

/*****************************************************************************
* Functions and structures related to connection and buffers
*****************************************************************************/
#define DATA_BUFFER_SIZE                   16 /* Size of bufer that collects HBR data from one peripheral. */

#define TX_BUFFER_READY                    1 /* TX buffer empty. */
#define TX_BUFFER_BUSY                     0 /* TX buffer in use. */                               

static uint8_t gs_tx_buffer = TX_BUFFER_READY;

typedef struct {
    uint8_t next_entry_index;
    uint8_t value[DATA_BUFFER_SIZE];
} data_buffer_t;

typedef struct {
    uint16_t              conn_handle;
    uint16_t              descriptor_handle;
    data_buffer_t         data_buffer;
} peripheral_t;

static peripheral_t gs_peripheral[NUMBER_OF_PERIPHERALS];

typedef struct
{
    uint16_t conn_handle;
    uint8_t  notification_enabled;
    uint8_t  cpu_request_done;
} central_t;

static central_t gs_central;
static bool gs_advertising_is_running = false;

// Application error handler
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    NVIC_SystemReset();
}

/**@brief Function resets buffer that keep data collected from peripheral.
 *
 * @param[in]   peripheral_id   Pointing the buffer of which periferal will be reset.
 *
 * @return
 * @retval      Error code: NRF_SUCCESS in case of success
 *                       or NRF_ERROR_INVALID_PARAM in case of providing peripheral_id from out of range.
*/
static uint8_t buffer_reset(uint16_t peripheral_id)
{
    uint8_t i = 0;

    if (peripheral_id < NUMBER_OF_PERIPHERALS)
    {
        gs_peripheral[peripheral_id].data_buffer.next_entry_index = 0;
        for (i = 0; i < DATA_BUFFER_SIZE; i++)
        {
            gs_peripheral[peripheral_id].data_buffer.value[i] = 0;
        }
        return NRF_SUCCESS;
    }
    return NRF_ERROR_INVALID_PARAM;
}


/**@brief Function counts average value of data collected in buffor for given peripheral.
 *
 * @param[in]   peripheral_id   Pointing peripheral to select buffer that should be used to cout the average .
 *
 * @return
 * @retval      Average value of data collected in buffer. In case of providing peripheral_id from out of range it returns 0.
*/
static uint8_t average_buffer_value(uint16_t peripheral_id)
{
    uint16_t sum        = 0;
    uint8_t  average    = 0;
    uint8_t  i          = 0;

    if (peripheral_id < NUMBER_OF_PERIPHERALS)
    {
        if (gs_peripheral[peripheral_id].data_buffer.next_entry_index > 0)
        {
            for (i = 0; i < gs_peripheral[peripheral_id].data_buffer.next_entry_index; i++)
            {
                sum += (uint8_t) gs_peripheral[peripheral_id].data_buffer.value[i];
            }
            average = (uint8_t) (sum / gs_peripheral[peripheral_id].data_buffer.next_entry_index);
        }
    }
    return average;
}

/**@brief Function adds value to the buffer for given peripheral.
 *
 * @param[in]   peripheral_id   Pointing peripheral to select buffer where the value shoudl be added.
 * @param[in]   value           Value to be placed in the buffer.
 *
 * @retval      Error code: NRF_SUCCESS in case of success
 *                       or NRF_ERROR_INVALID_PARAM in case of providing peripheral_id from out of range.
*/
static uint8_t buffer_add_value(uint16_t peripheral_id, uint8_t value)
{
    uint8_t i = 0;
    
    if (peripheral_id < NUMBER_OF_PERIPHERALS)
    {
        if (gs_peripheral[peripheral_id].data_buffer.next_entry_index >= DATA_BUFFER_SIZE)
        {
            for (i = 0; i < DATA_BUFFER_SIZE - 1; i++)
            {
                gs_peripheral[peripheral_id].data_buffer.value[i] = gs_peripheral[peripheral_id].data_buffer.value[i + 1];
            }
            gs_peripheral[peripheral_id].data_buffer.value[DATA_BUFFER_SIZE - 1] = value;
        }
        else
        {
            gs_peripheral[peripheral_id].data_buffer.value[gs_peripheral[peripheral_id].data_buffer.next_entry_index] = value;
            gs_peripheral[peripheral_id].data_buffer.next_entry_index++;
        }
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_PARAM;
    }
}


/**@brief BLE related global variables used by functions.
*/
static ble_gatts_char_handles_t gs_own_char_handle;

#define INVALID_DESCRIPTOR_HANDLE 0

