qodome/Firmware/iQo/IQ14BLW/nrf51/s130_demo_app/main.c
/**@brief Function resets structure that keep information about peer central.
*/
static void central_info_reset(void)
{
    memset((void*)&gs_central, 0, sizeof(central_t));
    gs_central.conn_handle          = BLE_CONN_HANDLE_INVALID;
    gs_central.notification_enabled = 0;
    gs_central.cpu_request_done  = 0;
    gs_tx_buffer = TX_BUFFER_READY;
}

/**@brief BLE related global variables used by functions.
*/
#define INVALID_DESCRIPTOR_HANDLE 0
#define ID_NOT_FOUND 0xFFFF

/**@brief Function resets structure that keep information about given peripherals.
 *
 * @param[in]   peripheral_id Peripherial id.
 *
 * @retval      NRF_SUCCESS if success or NRF_ERROR_INVALID_PARAM if peripheral_id out of rage
*/
static uint8_t peripheral_info_reset(uint16_t peripheral_id)
{
    if (peripheral_id < NUMBER_OF_PERIPHERALS)
    {
        memset((void*)&gs_peripheral[peripheral_id], 0, sizeof(peripheral_t));
        gs_peripheral[peripheral_id].conn_handle        = BLE_CONN_HANDLE_INVALID;
        gs_peripheral[peripheral_id].descriptor_handle = INVALID_DESCRIPTOR_HANDLE;

        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_PARAM;
    }
}

/**@brief Function resets structure that keep information about peer peripherals.
*/
static void peripherals_info_reset(void)
{
    uint16_t peripheral_id = ID_NOT_FOUND;
    
    for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++)
    {
        if (peripheral_info_reset(peripheral_id) == NRF_ERROR_INVALID_PARAM )
        {
            LOG_DEBUG("Peripheral information not reset - given invalid peripheral id (%i).", peripheral_id);
        }
    }
}

/**@brief Function provided reference to data structured for given connection handle.
 *
 * @param[in]   conn_handle Connection handle to be checked if it belongs to peer central.
 *
 * @retval      Id of peer peripheral or ID_NOT_FOUND if given connection handle does not belong to any peer peripheral.
*/
static uint16_t peripheral_id_get(uint16_t conn_handle)
{
    uint8_t i = 0;
    
    for (i = 0; i < NUMBER_OF_PERIPHERALS; i++)
    {
        if (conn_handle == gs_peripheral[i].conn_handle)
        {
            return i;
        }
    }
    return ID_NOT_FOUND;
}

/**@brief Function checks if given connection handle comes from peer central.
 *
 * @param[in]   conn_handle Connection handle to be checked if it belongs to peer central.
 *
 * @retval      true or false
*/
static bool is_central(uint16_t conn_handle)
{
    if (conn_handle == gs_central.conn_handle)
    {
        return true;
    }
    else
    {
        return false;
    }
}

/*****************************************************************************
* GAP events handling
*****************************************************************************/
#define EVENT_HANDLER_NONBLOCKING 0
static __attribute__((aligned(4))) uint8_t gs_evt_buf[sizeof(ble_evt_t) + BLE_L2CAP_MTU_DEF];
static ble_evt_t                       *gsp_ble_evt = (ble_evt_t *) gs_evt_buf;


/**@brief Function that handles BLE connect event for peer Central
 *
 * @param[in]   p_ble_evt        Pointer to buffer filled in with an event.
*/
static __INLINE void connect_peer_central(ble_evt_t *p_ble_evt)
{
    if (gs_central.conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        LOG_INFO("Central connected."); 
        gs_central.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
        gs_advertising_is_running = false;
    }
    else
    {
        LOG_INFO("Central already connected. Unrecognized connection."); 
    }
}

/**@brief Function that handles BLE disconnect event
 *
 * @param[in]   p_ble_evt        Pointer to buffer filled in with an event.
*/
static __INLINE void disconnect_event_handle(ble_evt_t *p_ble_evt)
{
    uint16_t peripheral_id = ID_NOT_FOUND;

   LOG_DEBUG("BLE_GAP_EVT_DISCONNECTED (0x%x) from connection handle 0x%x.", p_ble_evt->header.evt_id, p_ble_evt->evt.gap_evt.conn_handle);
   if (is_central(p_ble_evt->evt.gap_evt.conn_handle))
    {
        central_info_reset();
        gs_advertising_is_running = false;
        if (p_ble_evt->evt.gap_evt.params.disconnected.reason == BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION)
        {
            LOG_INFO("Central disconnected. Connection terminated remotely.");
        }
        else
        {
            LOG_INFO("Central disconnected.");
            if (p_ble_evt->evt.gap_evt.params.disconnected.reason == BLE_HCI_CONNECTION_TIMEOUT)
            {
                LOG_INFO("Reason: Timeout");
            }
            LOG_DEBUG("Central disconnected (reason 0x%x).", p_ble_evt->evt.gap_evt.params.disconnected.reason);
        }
    }
    else
    {
        if ((peripheral_id = peripheral_id_get(p_ble_evt->evt.gap_evt.conn_handle)) == ID_NOT_FOUND )
        {
            LOG_DEBUG("Disconnect from unknown device (0x%x)", p_ble_evt->evt.gap_evt.conn_handle);
        }
        else
        {
            if (peripheral_info_reset(peripheral_id) == NRF_ERROR_INVALID_PARAM)
            {
                LOG_DEBUG("Peripheral information not reset - given invalid peripheral id (%i).", peripheral_id);
            }
            
            switch(p_ble_evt->evt.gap_evt.params.disconnected.reason)
            {
                case BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION:
                    LOG_DEBUG("(Peripheral %i) Disconnected. Conection terminated remotely.", peripheral_id);
                    break;
                case BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION:
                    LOG_DEBUG("(Peripheral %i) Disconnected by this device.", peripheral_id);
                    break;
                case BLE_HCI_CONNECTION_TIMEOUT:
                    LOG_DEBUG("(Peripheral %i) Disconnected due to timeout.", peripheral_id);
                    break;
                default:
                    LOG_DEBUG("(Peripheral %i) Disconnected (reason 0x%x)", peripheral_id, p_ble_evt->evt.gap_evt.params.disconnected.reason);
                    break;
            }
            LOG_INFO("(Peripheral %i) Disconnected.", peripheral_id);
        }
    }
}

