qodome/Firmware/iQo/IQ14BLW/nrf51/s130_demo_app/main.c
/**@brief Function that handles BLE write event
 *
 * @param[in]   peripheral_id    Id of peripheral for handling this event.
 * @param[in]   p_ble_evt        Pointer to buffer filled in with an event.
*/
static __INLINE void write_event_handle(ble_evt_t *p_ble_evt)
{
    uint16_t write_event_value_handle = 0;
    uint8_t  write_data               = 0;

    write_event_value_handle = p_ble_evt->evt.gatts_evt.params.write.context.value_handle;
    write_data = p_ble_evt->evt.gatts_evt.params.write.data[0];
    /* Verify write event */
    if (write_event_value_handle != gs_own_char_handle.value_handle)
    {
        LOG_DEBUG("BLE_GATTS_EVT_WRITE handle value 0x%x != 0x%x", write_event_value_handle, gs_own_char_handle.value_handle);
        return;
    }
    if ((write_data != WRITE_VALUE_ENABLE_NOTIFICATIONS) && (write_data != WRITE_VALUE_DISABLE_NOTIFICATIONS))
    {
        LOG_INFO("Central sent improper value.");
        LOG_DEBUG("BLE_GATTS_EVT_WRITE data 0x%x out of range {0x01,0x00}", write_data, BLE_GATTS_ATTR_TYPE_DESC);
        return;
    }
    if (write_data == WRITE_VALUE_ENABLE_NOTIFICATIONS)
    {
        ble_gap_conn_params_t new_conn_params = {0};
        
        gs_central.notification_enabled = 1;
        LOG_INFO("Sending notifications enabled.");

        if (!gs_central.cpu_request_done)
        {
            uint32_t error_code = NRF_ERROR_NOT_FOUND;
            
            /* Request change of connection parameters to peer central. */
            new_conn_params.min_conn_interval = CENTRAL_MIN_CONN_INTERVAL;
            new_conn_params.max_conn_interval = CENTRAL_MAX_CONN_INTERVAL;
            new_conn_params.slave_latency     = CENTRAL_SLAVE_LATENCY;
            new_conn_params.conn_sup_timeout  = CENTRAL_CONN_SUP_TIMEOUT;
            if ((error_code = sd_ble_gap_conn_param_update(gs_central.conn_handle, &new_conn_params)) != NRF_SUCCESS)
            {
                LOG_DEBUG("(Central) Updating connection parameters failed - error code = 0x%x", error_code);
            }
            gs_central.cpu_request_done = 1; /* Already requested. */
        }
    }
    else if (write_data == WRITE_VALUE_DISABLE_NOTIFICATIONS)
    {
        gs_central.notification_enabled = 0;
        LOG_INFO("Sending notifications disabled.");
    }
}

// When timer time happens, call SPI to receive 1K bytes
static void scheduler_timeout_handler(void * p_context)
{
	scheduler_flag = 1;
	app_timer_stop(scheduler_timer_id);
}

/**@brief Function that handles BLE events
 *        It handles the events that comes in given time. That evoids skipping events that should be handled and are not handled in calling function.
 *        In case when expected event appears or getting timeout it returns that to calling function to be processed there.
 *
 * @param[in]   expected_event   Expected event.
 * @param[in]   timeout_ms       Timeout for waiting for expected event.
 * @param[in]   p_evt_buf        Pointer to buffer to be filled in with an event, or NULL to retrieve the event length. This buffer must be 4-byte aligned in memory.
 * @param[in]   evt_buf_len      The length of the buffer, on return it is filled with the event length.
 *
 * @return
 * @retval      NRF_SUCCESS Event pulled and stored into the supplied buffer.
 * @retval      NRF_ERROR_INVALID_ADDR Invalid or not sufficiently aligned pointer supplied.
 * @retval      NRF_ERROR_NOT_FOUND No events ready to be pulled.
 * @retval      NRF_ERROR_DATA_SIZE Event ready but could not fit into the supplied buffer.
*/
uint32_t event_handle(uint8_t expected_event, uint32_t timeout_ms, uint8_t *p_evt_buf, uint16_t evt_buf_len)
{
    uint16_t  evt_len       = 0;
    ble_evt_t *p_ble_evt    = (ble_evt_t *) p_evt_buf;
    uint32_t  error_code    = NRF_ERROR_NOT_FOUND;
    uint16_t  peripheral_id = ID_NOT_FOUND;

    if (timeout_ms != EVENT_HANDLER_NONBLOCKING) 
    {
    	scheduler_flag = 0;
    	app_timer_start(scheduler_timer_id, timeout_ms, NULL);
    }
    
    do
    {
        evt_len = evt_buf_len;
        error_code = sd_ble_evt_get(p_evt_buf, &evt_len);
            
        if (error_code == NRF_SUCCESS)
        {
            /*Catching expected event*/
            if (expected_event == p_ble_evt->header.evt_id)
            {
                return NRF_SUCCESS;
            }
            
            /*Event handler*/

            switch (p_ble_evt->header.evt_id)
            {
                case BLE_GAP_EVT_TIMEOUT:
                    if (gsp_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISING)
                    {
                        gs_advertising_is_running = false;

                        LOG_INFO("Advertisement stopped.");
                        if ((error_code = advertise()) != NRF_SUCCESS)
                        {
                            LOG_DEBUG("Restarting advertisement failed - error code = 0x%x", error_code);
                            LOG_INFO("Restarting advertisement failed.");
                        }
                    }
                break;
                case BLE_GAP_EVT_CONNECTED:
                    /*Expected connection from peer central, peer peripherals are handled in connect()*/
                    if(p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_PERIPH) //If this side is BLE_GAP_ROLE_PERIPH then BLE_GAP_EVT_CONNECTED comes from peer central
                    {
                        connect_peer_central(p_ble_evt);
                    }
                    else if(p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_CENTRAL) //If this side is BLE_GAP_ROLE_CENTRAL then BLE_GAP_EVT_CONNECTED comes from peer peropheral
                    {
                        //Disconnecting peripheral
                        if ((error_code = sd_ble_gap_disconnect(p_ble_evt->evt.gap_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION)) != NRF_SUCCESS)
                        {
                            LOG_INFO("Disconnection of non-central failed.");
                            LOG_DEBUG("Disconnecting failed for conn handle = 0x%x, error - code = 0x%x", p_ble_evt->evt.gap_evt.conn_handle, error_code);
                        }
                        else
                        {
                            LOG_DEBUG("Disconnected for conn handle = 0x%x", p_ble_evt->evt.gap_evt.conn_handle);
                        }
                    }
                break;
                case BLE_GAP_EVT_DISCONNECTED:
                    disconnect_event_handle(p_ble_evt);
                    break;
                case BLE_GATTS_EVT_WRITE:
                    write_event_handle(p_ble_evt);
                    break;
                case BLE_EVT_TX_COMPLETE:
                    gs_tx_buffer = TX_BUFFER_READY;
                    break;
                case BLE_GATTS_EVT_SYS_ATTR_MISSING:
                    sd_ble_gatts_sys_attr_set(p_ble_evt->evt.gatts_evt.conn_handle, NULL, 0);
                    break;
                case BLE_GATTC_EVT_HVX:
                    /*Handled in main loop - in do_work()*/
                    break;
                case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
                    if ((peripheral_id = peripheral_id_get(p_ble_evt->evt.gap_evt.conn_handle)) != ID_NOT_FOUND )
                    {
                        ble_gap_conn_params_t conn_params;
                        memcpy(&conn_params, &p_ble_evt->evt.gap_evt.params.conn_param_update_request.conn_params, sizeof(ble_gap_conn_params_t));
                        if ((error_code = sd_ble_gap_conn_param_update(gs_peripheral[peripheral_id].conn_handle, &conn_params)) == NRF_SUCCESS)
                        {
                            LOG_INFO("(Peripheral %i) Requests to change connection parameters (timeout = 0x%x, min conn. interval = 0x%x, max conn. interval = 0x%x, latency = 0x%x).", peripheral_id, conn_params.conn_sup_timeout, conn_params.min_conn_interval, conn_params.max_conn_interval, conn_params.slave_latency);
                        }
                        else
                        {
                            LOG_DEBUG("(Peripheral %i) Updating connection parameters failed - error code = 0x%x", peripheral_id, error_code);
                        }
                    }
                    break;
                case BLE_GAP_EVT_CONN_PARAM_UPDATE:
                    if ((peripheral_id = peripheral_id_get(p_ble_evt->evt.gap_evt.conn_handle)) != ID_NOT_FOUND )
                    {
                        LOG_INFO("(Peripheral %i) Connection parameters updated.", peripheral_id);
                    }
                    break;
                case BLE_GATTC_EVT_WRITE_RSP:
                    if ((peripheral_id = peripheral_id_get(p_ble_evt->evt.gattc_evt.conn_handle)) != ID_NOT_FOUND )
                    {
                        LOG_DEBUG("(Peripheral %i) Write confirmed", peripheral_id);
                        LOG_INFO("(Peripheral %i) CCCD update confirmed.", peripheral_id);
                    }
                    break;
                case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
                    LOG_INFO("Pairing not supported.");
                    if ((error_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL)) != NRF_SUCCESS)
                    {
                       LOG_DEBUG("(Central) sd_ble_gap_sec_params_reply() error code 0x%x", error_code);
                    }
                    break;
                case BLE_GAP_EVT_AUTH_STATUS:
                    if(p_ble_evt->evt.gap_evt.params.auth_status.auth_status != BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP)
                    {
                        LOG_DEBUG("BLE_GAP_EVT_AUTH_STATUS = 0x%x", p_ble_evt->evt.gap_evt.params.auth_status.auth_status);
                    }
                    break;
                default:
                    LOG_DEBUG("Unhandled event: header: 0x%x", p_ble_evt->header.evt_id);
                    break;
            }
        }
        if (timeout_ms == EVENT_HANDLER_NONBLOCKING) /* No event received, abort */
        {
            return error_code;
        }
        if (NRF_ERROR_NOT_FOUND == error_code) /* No event received, continue */
        {
            sd_app_evt_wait(); 
            sd_nvic_ClearPendingIRQ(SD_EVT_IRQn);
            continue;
        }
        if (error_code != NRF_SUCCESS)
        {
            return error_code;
        }
    } while (scheduler_flag == 0);
 
    return NRF_ERROR_NOT_FOUND;
}

/*****************************************************************************
* Functions related to service setup, advertisement, discovery, device connection
*****************************************************************************/
/**@brief Function steup own service to be used to notify average values to peer central.
 *
 * Function does not return error code. If any internal call failes it triggers APP_ASSERT.
*/
static void own_service_setup(void)
{
    uint32_t                error_code              = NRF_ERROR_NOT_FOUND;
    ble_uuid_t              own_service_uuid        = {0};
    ble_uuid_t              attr_uuid               = {0};
    ble_uuid_t              desc_uuid               = {0};
    ble_gatts_char_md_t     char_md                 = {{0}};
    ble_gatts_attr_t        attr                    = {0};
    ble_gatts_attr_md_t     attr_md                 = {{0}};
    ble_gatts_attr_md_t     cccd_md                 = {{0}};

    uint8_t                 characteristic_value[]  = SERVICE_CHARACTERISTIC_VALUE;
    ble_gatts_attr_md_t     desc_md                 = {{0}};
    ble_gatts_attr_t        desc                    = {0};
    uint8_t                 uuid_type               = 0;
    ble_uuid128_t           uuid128                 = {{SERVICE_UUID128}};
    uint16_t                own_desc_handle         = 0;    
    uint8_t                 own_desc_value[]        = SERVICE_CHARACTERISTIC_DESC_VALUE;
    uint16_t                own_service_handle      = 0;

