qodome/Firmware/iQo/IQ14BLW/nrf51/s130_demo_app/main.c
    gs_peripheral[peripheral_id].descriptor_handle = INVALID_DESCRIPTOR_HANDLE; /*Means that handle has not been found.*/
    
    /* Service discovery */
    handle_range.start_handle = 0x0001;
    handle_range.end_handle = BLE_GATTC_HANDLE_END;
    do
    {
        if ((error_code = sd_ble_gattc_primary_services_discover(gs_peripheral[peripheral_id].conn_handle, handle_range.start_handle, NULL)) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Service discovery: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if ((error_code = event_handle(BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP, 2000, gs_evt_buf, sizeof(gs_evt_buf))) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) service discovery response: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if (gsp_ble_evt->evt.gattc_evt.gatt_status != BLE_GATT_STATUS_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Service discovery response: status code 0x%x", peripheral_id, error_code);
            return NRF_ERROR_NOT_FOUND;
        }
        for (i = 0; i < gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.count; i++)
        {
            if ((gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].uuid.uuid == HEART_RATE_SERVICE )
                && (gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].uuid.type == BLE_UUID_TYPE_BLE))
            {
                LOG_DEBUG("Service found UUID 0x%04X", gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].uuid.uuid);
                handle_range.start_handle = gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].handle_range.start_handle;
                if (gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.count > i + 1)
                {
                    handle_range.end_handle = gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i + 1].handle_range.start_handle - 1;
                }
                service_found = 1;
                break;
            }
        }
        if (service_found == 0)
        {
            handle_range.start_handle = gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.count - 1].handle_range.end_handle;
        }
    } while ((service_found == 0) && (gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.count > 0));
    
    if (service_found == 0)
    {
        LOG_DEBUG("ISSUE (Peripheral %i) Service not found", peripheral_id);
        return NRF_ERROR_NOT_FOUND;
    }
    
    /* Characteristic discovery */
    do
    {
        if ((error_code = sd_ble_gattc_characteristics_discover(gs_peripheral[peripheral_id].conn_handle, &handle_range)) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Characteristic discovery: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if ((error_code = event_handle(BLE_GATTC_EVT_CHAR_DISC_RSP, 2000, gs_evt_buf, sizeof(gs_evt_buf))) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Characteristic discovery response: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if (gsp_ble_evt->evt.gattc_evt.gatt_status != BLE_GATT_STATUS_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Characteristic discovery response: error code 0x%x", peripheral_id, error_code);
            return NRF_ERROR_NOT_FOUND;
        }
        for (i=0; i < gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.count; i++)
        {
            if ((gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[i].uuid.uuid == HEART_RATE_SERVICE_CHARACTERISTICS)
                && (gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[i].uuid.type == BLE_UUID_TYPE_BLE))
            {
                LOG_DEBUG("Characteristic found UUID 0x%04X", gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[i].uuid.uuid);
                handle_range.start_handle = gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[i].handle_value + 1;
                if (gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.count > i + 1)
                {
                    handle_range.end_handle = gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[i + 1].handle_decl - 1;
                }
                characteristic_found = 1;
                break;
            }
        }
        
        if (characteristic_found == 0)
        {
            handle_range.start_handle = gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.count - 1].handle_decl + 1;
            LOG_DEBUG("Characteristic handle range 0x%04X", handle_range.start_handle);
        }
    } while ((characteristic_found == 0) && (gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.count > 0));
    if (characteristic_found == 0)
    {
        LOG_DEBUG("(Peripheral %i) Characteristic not found", peripheral_id);
        return NRF_ERROR_NOT_FOUND;
    }

    /* Descriptor discovery */
    do
    {
        if ((error_code = sd_ble_gattc_descriptors_discover(gs_peripheral[peripheral_id].conn_handle, &handle_range)) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Descriptor discovery: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if ((error_code = event_handle(BLE_GATTC_EVT_DESC_DISC_RSP, 2000, gs_evt_buf, sizeof(gs_evt_buf))) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Descriptor discovery response: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if (gsp_ble_evt->evt.gattc_evt.gatt_status != BLE_GATT_STATUS_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Descriptor discovery response error code 0x%x", peripheral_id, error_code);
            return NRF_ERROR_NOT_FOUND;
        }
        for (i = 0; i < gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.count; i++)
        {
            if ((gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid.uuid == HEART_RATE_SERVICE_DESCRIPTOR)
                && (gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid.type == BLE_UUID_TYPE_BLE))
            {
                LOG_DEBUG("Descriptor found UUID 0x%04X", gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid.uuid);
                /* Heart Rate Service handle found */
                gs_peripheral[peripheral_id].descriptor_handle = gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[i].handle;
                break;
            }
        }
        if (gs_peripheral[peripheral_id].descriptor_handle == 0)
        {
            handle_range.start_handle = gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.count - 1].handle + 1;
        }
    } while ((gs_peripheral[peripheral_id].descriptor_handle == INVALID_DESCRIPTOR_HANDLE) && (gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.count > 0));
    if (gs_peripheral[peripheral_id].descriptor_handle == INVALID_DESCRIPTOR_HANDLE)
    {
        LOG_DEBUG("(Peripheral %i) Descriptor not found", peripheral_id);
        return NRF_ERROR_NOT_FOUND;
    }
    return error_code;
}


/**@brief Function writes cccd to get notification from given peer peripheral.
 *
 * @param[in]   peripheral_id   Peripheral id.
 *
 * @return
 * @retval      NRF_SUCCESS if discovery done without NRF errors
 *              otherwise NRF error code.
*/
static uint32_t notifications_enable(uint16_t peripheral_id)
{
    uint32_t                 error_code   = NRF_ERROR_NOT_FOUND;
    ble_gattc_write_params_t write_params = {0};
    uint16_t                 write_value  = WRITE_VALUE_ENABLE_NOTIFICATIONS;

    /* Central writes to CCCD of peripheral to receive indications */
    write_params.write_op = BLE_GATT_OP_WRITE_REQ;
    write_params.handle = gs_peripheral[peripheral_id].descriptor_handle;
    write_params.offset = 0;
    write_params.len = sizeof(write_value);
    write_params.p_value = (uint8_t *)&write_value;

