qodome/Firmware/iQo/IQ14BLW/nrf51/s130_demo_app/main.c
    }    
}

// When timer time happens, toggle GPIO to raise interrupt
static void timer_timeout_handler(void * p_context)
{
	nrf_gpio_pin_toggle(12);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);

    APP_ERROR_CHECK(app_timer_create(&scheduler_timer_id, APP_TIMER_MODE_REPEATED, scheduler_timeout_handler));

    APP_ERROR_CHECK(app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler));

    APP_ERROR_CHECK(app_timer_start(m_app_timer_id, 50000, NULL));
}

static void io_init(void)
{
	nrf_gpio_pin_dir_set(12, NRF_GPIO_PIN_DIR_OUTPUT);
	nrf_gpio_pin_clear(12);
	nrf_gpio_cfg_output(12);
	nrf_gpio_pin_clear(12);
}

/**@brief Initial configuration of peripherals and hardware before the test begins. Calling the main loop.    
 */
int main(void)
{
    board_configure();
	io_init();
	timers_init();

    LOG_DEBUG("%s: Enabling SoftDevice...", __FUNCTION__);
    
    if (NRF_SUCCESS != sd_softdevice_enable((uint32_t)NRF_CLOCK_LFCLKSRC_XTAL_75_PPM, softdevice_assert_callback))
    {
        APP_ASSERT (false);
    }
    
    if (NRF_SUCCESS != sd_nvic_EnableIRQ(SD_EVT_IRQn))
    {
        APP_ASSERT (false);
    }
    LOG_INFO("#########################");
    LOG_INFO("# S130 Demo application #");
    LOG_INFO("#########################");
    LOG_INFO("INFO: Press button 0 to connect to peripherals.");
    LOG_INFO("INFO: Press button 1 to see the buffered data");
    LOG_INFO("INFO: Press both 0 and 1 buttons to quit demo.");
    
    own_service_setup();
    peripherals_info_reset();
    central_info_reset();

    do_work();
    
    LOG_DEBUG("%s: End demo application...", __FUNCTION__);
    while (1);
}

/**@brief Assert callback handler for SoftDevice asserts. */
void softdevice_assert_callback(uint32_t pc, uint16_t line_num, const uint8_t *file_name)
{
    gs_sd_assert_line_num = line_num;
    memset((void*)gs_sd_assert_file_name, 0x00, sizeof(gs_sd_assert_file_name));
    (void)strncpy((char*) gs_sd_assert_file_name, (const char*)file_name, sizeof(gs_sd_assert_file_name) - 1);
    
     LOG_DEBUG("%s: SOFTDEVICE ASSERT: line = %d file = %s", __FUNCTION__, gs_sd_assert_line_num, gs_sd_assert_file_name);

    while (1);
}

/**@brief Assert callback handler for application asserts. */
void app_assert_callback(uint32_t line_num, const uint8_t *file_name)
{
    gs_app_assert_line_num = line_num;
    memset((void*)gs_app_assert_file_name, 0x00, sizeof(gs_app_assert_file_name));
    (void)strncpy((char*) gs_app_assert_file_name, (const char*)file_name, sizeof(gs_app_assert_file_name) - 1);
    
     LOG_DEBUG("%s: APP ASSERT: line = %d file = %s", __FUNCTION__, gs_app_assert_line_num, gs_app_assert_file_name);

    while (1);
}

/**@brief BLE Stack event interrupt
 *                Triggered whenever an event is ready to be pulled
 */
void SD_EVT_IRQHandler(void)
{
}


/**@brief Hardware configuration. Specify which board you are using.
 */
static void board_configure(void)
{
#if (BOARD_TYPE == BOARD_PCA10001)
        NRF_GPIO->DIRSET = 0x0000F0FF;
        NRF_GPIO->OUTCLR = 0x0000F0FF;
    #else
        NRF_GPIO->DIRSET = 0xF0FF0000;
        NRF_GPIO->OUTCLR = 0xF0FF0000;
#endif
    
    uart_init(UART_BAUD_19K2);

    NRF_GPIO->PIN_CNF[BUTTON_0] = (GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos)
                                | (GPIO_PIN_CNF_DRIVE_S0S1     << GPIO_PIN_CNF_DRIVE_Pos)
                                | (GPIO_PIN_CNF_PULL_Pullup    << GPIO_PIN_CNF_PULL_Pos)
                                | (GPIO_PIN_CNF_INPUT_Connect  << GPIO_PIN_CNF_INPUT_Pos)
                                | (GPIO_PIN_CNF_DIR_Input      << GPIO_PIN_CNF_DIR_Pos);

    NRF_GPIO->PIN_CNF[BUTTON_1] = (GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos)
                                | (GPIO_PIN_CNF_DRIVE_S0S1     << GPIO_PIN_CNF_DRIVE_Pos)
                                | (GPIO_PIN_CNF_PULL_Pullup    << GPIO_PIN_CNF_PULL_Pos)
                                | (GPIO_PIN_CNF_INPUT_Connect  << GPIO_PIN_CNF_INPUT_Pos)
                                | (GPIO_PIN_CNF_DIR_Input      << GPIO_PIN_CNF_DIR_Pos);
    
#if (BOARD_TYPE == BOARD_PCA0001)
     LOG_DEBUG("%s: Hardware initiated. Usign PCA10001 (Ev. kit)", __FUNCTION__);
#else
     LOG_DEBUG("%s: Hardware initiated. Usign PCA10005 (Dev. kit)", __FUNCTION__);
#endif
}

/**@brief Logging function, used for formated output on the UART.
 */
static void uart_logf(const char *fmt, ...)
{
    uint16_t i = 0;
    static uint8_t logf_buf[150];
    va_list args;
    va_start(args, fmt);    
    i = vsnprintf((char*)logf_buf, sizeof(logf_buf) - 1, fmt, args);
    logf_buf[i] = 0x00; /* Make sure its zero terminated */
    uart_write_buf((uint8_t*)logf_buf, i);
    va_end(args);
}
